const String requieredFeild = 'هذا الحقل مطلوب';
const String role1 = 'عذراً لا يمكن تغيير الحالة ويوجد تصنيف رئيسي';
const String role2 = 'عذراً لا يمكن اختيار تصنيف رئيسي ونوع التصنيف رئيسي';
const String role3 =
    'عذراً لا يمكن تغيير الحالة ولا يوجد تصنيف رئيسي ونوع التصنيف ليس رئيسي';
const String role4 =
    'عذراً لا يمكن اختيار تصنيف رئيسي ونوع التصنيف رئيسي وفرعي بنفس الوقت';
const String role5 = 'عذراً لا يمكن محو التصنيف الرئيسي ونوع التصنيف فرعي ';
const String role6 = 'عذراً لا يتوفر كمية في المخزن ';
